
[GUNRANGE1]
description=Welcome to the Blacklight training program.
hud=
title=HQ

[GUNRANGE10_0]
description=The grenade is a soldier's best friend. A properly thrown grenade can be the turning point of an engagement.
hud=
title=HQ

[GUNRANGE10_1]
description=Use {GBA_SelectGear1,20,20,-4} to equip a grenade and {GBA_Fire,20,20,-4} to throw it.
hud=
title=HQ

[GUNRANGE11_0]
description=There are an array of other weapons for you to try out at the range.
hud=
title=HQ

[GUNRANGE11_1]
description=You will soon be able to create your own custom weapons to fit your preferences.
hud=
title=HQ

[GUNRANGE11_2]
description=When you are finished, please proceed toward the Killhouse.
hud=
title=HQ

[GUNRANGE3_0]
description=Let's get your suit calibrated properly.
hud=
title=HQ

[GUNRANGE3_1]
description=Use your mouse to look around the training facility.
hud=
title=HQ

[GUNRANGE3_2]
description=You can invert your mouse movement in the "Settings" menu, under "Control".
hud=
title=HQ

[GUNRANGE3_3]
description=To leave this room, you will have to hack the wall panel.
hud=
title=HQ

[GUNRANGE3_4]
description=Walk up to the panel and interact to begin hacking.
hud=
title=HQ

[GUNRANGE3_5]
description=Move left and right to match the outer number with the centered one.
hud=
title=HQ

[GUNRANGE4_0]
description=Now, let us begin. The most important part of combat is knowing how to use your weapon.
hud=
title=HQ

[GUNRANGE4_1]
description=Proceed into the gun range to continue your training.
hud=
title=HQ

[GUNRANGE5]
description=Pressing {GBA_Fire,20,20,-4} will fire your weapon, toss a grenade, or other actions, depending on what you are holding.
hud=
title=HQ

[GUNRANGE6_0]
description=For a more accurate shot, press {GBA_ToggleZoom,20,20,-4} to aim down the sights of your gun.
hud=
title=HQ

[GUNRANGE6_1]
description=You can change this to a hold action in the "Settings" menu, under "Control".
hud=
title=HQ

[GUNRANGE7_0]
description=Always reload your weapon after use by pressing {GBA_Reload,20,20,-4}.
hud=
title=HQ

[GUNRANGE7_1]
description=Using {GBA_Melee,20,20,-4} will perform a melee attack. This can be useful during desperate situations.
hud=
title=HQ

[GUNRANGE8_0]
description=You can access your primary and secondary weapons with {GBA_SelectPrimaryWeapon,20,20,-4} and {GBA_SelectSecondaryWeapon,20,20,-4}.
hud=
title=HQ

[GUNRANGE8_1]
description=Your other items can be accessed with {GBA_SelectGear1,20,20,-4}, {GBA_SelectGear2,20,20,-4}, {GBA_SelectGear3,20,20,-4}, and {GBA_SelectGear4,20,20,-4}.
hud=
title=HQ

[GUNRANGE9_0]
description=Now for the fun part. The helmet you are wearing is equipped with a Hyper Reality Visor, or HRV.
hud=
title=HQ

[GUNRANGE9_1]
description=This will allow you to see all of the key parts of the battlefield. Press {GBA_ToggleVisor,20,20,-4} to turn on HRV mode.
hud=
title=HQ

[GUNRANGE9_2]
description=This is useful for coordinating attacks with your teammates and locating hidden enemies.
hud=
title=HQ

[GUNRANGEOBJ1]
description=<font color='#00CCFF'>Hack</font> the <font color='#00CCFF'>Console</font> to gain entry.
hud=
title=Open the door

[GUNRANGEOBJ2]
description=&#187;&nbsp;All default <font color='#00CCFF'>primary</font> and <font color='#00CCFF'>secondary weapons</font> are available.<br>&#187;&nbsp;Try new weapons at any point while in this facility.
hud=
title=Select a weapon

[GUNRANGEOBJ3]
description=&#187;&nbsp;Defeating opponents, completing objectives, and many other actions, will earn <font color='#00CCFF'>Combat Points (CP)</font>.<br>&#187;&nbsp;Each target here is worth a standard enemy kill.
hud=
title=Destroy 10 targets

[GUNRANGEOBJ4]
description=&#187;&nbsp;<font color='#00CCFF'>Weapon Depots</font> can be used in battle to purchase powerful gear and restore supplies.<br>&#187;&nbsp;The contents of a Weapon Depot can be customized in the main menu.<br>&#187;&nbsp;All Weapon Depot gear is available to try on the adjacent rack.
hud=
title=Spend Combat Points (CP) at Weapon Depots

[GUNRANGEOBJ5]
description=&#187;&nbsp;<font color='#00CCFF'>Press</font> {GBA_ToggleVisor,20,20,-4} to use <font color='#00CCFF'>Hyper-Reality Vision (HRV)</font>.<br>&#187;&nbsp;HRV highlights other Agents, Weapon Depots, and Consoles through walls.<br>&#187;&nbsp;HRV can be used as often as it is recharged.
hud=
title=Use HRV to find the hidden Console

[GUNRANGEOBJS]
description=Use the Console to summon <font color='#00CCFF'>Hardsuits</font>.
hud=
title=Training Mode Only

[GUNRANGEOBJ6]
description=&#187;&nbsp;<font color='#00CCFF'>Hardsuits</font> must be summoned under open sky.<br>&#187;&nbsp;During battle, purchase a Hardsuit from the Weapon Depot.<br>&#187;&nbsp;Hardsuits have two weapons. <font color='#00CCFF'>Press</font> {GBA_Fire,20,20,-4} or {GBA_ToggleZoom,20,20,-4} to fire.
description_x=&#187;&nbsp;<font color='#00CCFF'>Hardsuits</font> must be summoned under open sky.<br>&#187;&nbsp;During battle, purchase a Hardsuit from the Weapon Depot.<br>&#187;&nbsp;Hardsuits have two weapons. <font color='#00CCFF'>Press</font> {GBA_Fire,20,20,-4} or {GBA_HoldZoom,20,20,-4} to fire.
hud=
title=Destroy 20 targets while piloting a Hardsuit

[GUNRANGEOBJ7]
description=&#187;&nbsp;<font color='#00CCFF'>Press</font> {GBA_UseObject,20,20,-4} to exit a Hardsuit.<br>&#187;&nbsp;<font color='#00CCFF'>HRV</font> will highlight a <font color='#FF6A00'>Hardsuit's weakpoint</font>.<br>&#187;&nbsp;Destroy Hardsuits easily by attacking their weakpoint or using the <font color='#00CCFF'>Rocket Stinger</font>.<br>&#187;&nbsp;Incendiary weapons, like the <font color='#00CCFF'>Flamethrower</font>, can damage the pilot inside a Hardsuit.
description_x=&#187;&nbsp;<font color='#00CCFF'>Press</font> {GBA_SwitchWeaponPressHoldPickup,20,20,-4} to exit a Hardsuit.<br>&#187;&nbsp;<font color='#00CCFF'>HRV</font> will highlight a <font color='#FF6A00'>Hardsuit's weakpoint</font>.<br>&#187;&nbsp;Destroy Hardsuits easily by attacking their weakpoint or using the <font color='#00CCFF'>Rocket Stinger</font>.<br>&#187;&nbsp;Incendiary weapons, like the <font color='#00CCFF'>Flamethrower</font>, can damage the pilot inside a Hardsuit.
hud=
title=Destroy a Hardsuit

[GUNRANGEOBJ8]
description=&#187;&nbsp;Try experimenting with other weapons and gear.<br>&#187;&nbsp;Exit under the spinning light when ready.
hud=
title=Objectives complete

[HANGER1_0]
description=You will find Weapon Depots scattered throughout the battlefield.
hud=
title=HQ

[HANGER1_1]
description=Here, you will have access to special weapons that are purchased using Combat Points (CP) earned in battle.
hud=
title=HQ

[HANGER1_2]
description=Approach the Weapon Depot and press {GBA_UseObject,20,20,-4} to access it.
hud=
title=HQ

[HANGER2_0]
description=If you have earned enough CP, you can purchase the Hardsuit from the Weapon Depot.
hud=
title=HQ

[HANGER2_1]
description=This mechanized tank is a game-changer. With a good pilot, one of these beasts will be able to take on a full squad of enemies.
hud=
title=HQ

[HANGER3_0]
description=Be aware of your surroundings on the battlefield. A clear line of entry is needed for the Hardsuit to be airdropped to your location.
hud=
title=HQ

[HANGER3_1]
description=Aim the Hardsuit targeter on the ground and hold the trigger until the position is locked in.
hud=
title=HQ

[HANGER3_2]
description=Hardsuits are equipped with a minigun and a railgun for extreme stopping power.
hud=
title=HQ

[HANGER3_3]
description=Other special weapons are available from the weapon depots. Special weapons are pivotal in a successful engagement.
hud=
title=HQ

[HANGER4_0]
description=That concludes the Blacklight training program. The training rooms are all unlocked if you would like to keep practicing.
hud=
title=HQ

[HANGER4_1]
description=When you are ready for the real thing, exit the hanger to be deployed.
hud=
title=HQ

[HANGER5]
description=See you on the battlefield, Agent.
hud=
title=HQ

[HORDE1]
description=OH SHIT, WAVE 1!!!
hud=
title=HQ

[HORDE2]
description=ERMAGERSCH, WAVE 2!!!
hud=
title=HQ

[HORDE3]
description=SHIZZLE, WAVE 3!!!
hud=
title=HQ

[HORDE4]
description=WE GONNA DIE, IT'S WAVE 4!!!
hud=
title=HQ

[HORDE5]
description=SOMEONE GO GRAB A HARDSUIT, IT'S THE FINAL WAAAAAVE!!!
hud=
title=HQ

[HORDE6]
description=SNAAAAAAKKE111!1ONE1!
hud=
title=HQ

[KILLHOUSE1_0]
description=The Killhouse is a simulation of the reaction time needed on a real battlefield.
hud=
title=HQ

[KILLHOUSE1_1]
description=Targets will appear very quickly and in a variety of places.
hud=
title=HQ

[KILLHOUSE1_2]
description=Move through the course as quickly as possible, while still maintaining your accuracy with your weapon.
hud=
title=HQ

[KILLHOUSE2]
description=Simply use {GBA_Jump,20,20,-4} to jump over obstacles in the world.
hud=
title=HQ

[KILLHOUSE3]
description=Press {GBA_HoldCrouch,20,20,-4} to crouch under objects. This can be changed from a toggle under "Settings".
hud=
title=HQ

[KILLHOUSE4]
description= Sometimes you will need to make a quick escape from a bad situation. Hold {GBA_HoldSprint,20,20,-4} to sprint for a short period of time.
hud=
title=HQ

[KILLHOUSE5]
description=Not bad, Agent. You may proceed through the door into the hanger to learn about the Weapon Depot.
hud=
title=HQ

[OBJECTIVE1-1]
description=Hack The Door
hud=
title=Training Objective 01-1

[OBJECTIVE1-2]
description=Enter The Gun Range
hud=
title=Training Objective 01-2

[OBJECTIVE2]
description=Enter The Killhouse
hud=
title=Training Objective 02

[OBJECTIVE3]
description=Enter The Hardsuit Hanger
hud=
title=Training Objective 03

[OBJECTIVE4]
description=Exit The Training Facility
hud=
title=Training Objective 04

[GUNRANGEDIALOG5-1]
description=
hud=
title=

[GUNRANGEDIALOG5-2]
description=
hud=
title=

[GUNRANGEDIALOG5-3]
description=
hud=
title=

[GUNRANGEDIALOG6-1]
description=
hud=
title=

[GUNRANGEDIALOG6-2]
description=
hud=
title=

[GUNRANGEDIALOG6-3]
description=
hud=
title=
